Revit 2027 API
NavisworksExportOptions.ConvertLinkedCADFormats Property
 True to convert linked CAD formats, false otherwise. Default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ConvertLinkedCADFormats { get; set; }
Public Property ConvertLinkedCADFormats As Boolean
	Get
	Set
public:
property bool ConvertLinkedCADFormats {
	bool get ();
	void set (bool value);
}
member ConvertLinkedCADFormats : bool with get, set
Property Value
Boolean
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace